app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required|min:6',
        ]);

        $user = User::where('email', $request->email)
            ->where('status', 'active')
            ->first();
---
select * from `user` where `email` = 'sandybom21@gmail.com' and `status` = 'active' limit 1