app/Http/Controllers/Auth/RegisterController.php

    private function createFreeSubscription($ponpesId)
    {
        // Ambil plan FREE
        $freePlan = DB::table('plans')->where('slug', 'free')->first();

        if (!$freePlan) {
            throw new \Exception("Free Plan tidak ditemukan. Harap isi tabel plans.");
        }

        // Cek apakah ponpes sudah punya subscription
        $existing = DB::table('subscriptions')
            ->where('ponpes_id', $ponpesId)
            ->where('status', 'active')
            ->first();

        if ($existing) {
            return; // sudah ada, jangan buat lagi
        }

        // Buat subscription gratis
        DB::table('subscriptions')->insert([
            'ponpes_id' => $ponpesId,
            'plan_id' => $freePlan->id,
            'status' => 'active',
            'billing_cycle' => 'monthly',
            'start_date' => now()->toDateString(),
            'current_period_end' => now()->addDays(30)->toDateString(),
            'auto_renew' => 1,
            'metadata' => json_encode([]),
            'created_at' => now(),
            'updated_at' => now(),
        ]);
---
select * from `plans` where `slug` = 'free' limit 1
select * from `subscriptions` where `ponpes_id` = 'ponpes_VAFu4uZ5MEf5PyDn' and `status` = 'active' limit 1
insert into `subscriptions` (`ponpes_id`, `plan_id`, `status`, `billing_cycle`, `start_date`, `current_period_end`, `auto_renew`, `metadata`, `created_at`, `updated_at`) values ('ponpes_VAFu4uZ5MEf5PyDn', 4, 'active', 'monthly', '2026-01-31', '2026-03-02', 1, '[]', '2026-01-31 17:23:20', '2026-01-31 17:23:20')

            $otp = rand(100000, 999999);

            // ✅ BUAT USER DENGAN STATUS PENDING (BELUM VERIFIED)
            $user = User::create([
                'ponpes_id' => $ponpesId,
                'username' => $data['username'],
                'email' => $data['email'],
                'password' => Hash::make($data['password']),
                'role' => $data['role'],
                'otp_code' => $otp,
                'otp_expired_at' => now()->addMinutes(10),
                'email_verified_at' => null, // ✅ BELUM VERIFIED
                'status' => 'pending', // ✅ TAMBAH FIELD STATUS
            ]);
---
insert into `user` (`ponpes_id`, `username`, `email`, `password`, `role`, `otp_code`, `otp_expired_at`, `email_verified_at`, `status`) values ('ponpes_VAFu4uZ5MEf5PyDn', 'Arya Ilham', 'sandyujang21@gmail.com', '$2y$12$uVKtQtTdPbOImXKskjm4h.4xtIvZVpJGxc1vBxLqWT51LBFnFpizy', 'Admin', 561211, '2026-01-31 17:33:20', null, 'pending')

    private function createNewPonpes($namaPonpes)
    {
        $ponpesId = 'ponpes_' . Str::random(16);

        while (DB::table('ponpes')->where('id_ponpes', $ponpesId)->exists()) {
            $ponpesId = 'ponpes_' . Str::random(16);
        }

        DB::table('ponpes')->insert([
            'id_ponpes' => $ponpesId,
            'nama_ponpes' => $namaPonpes,
            'alamat' => null,
            'tahun_berdiri' => null,
            'telp' => null,
            'email' => null,
            'logo_ponpes' => null,
            'jumlah_santri' => 0,
            'jumlah_staf' => 0,
            'pimpinan' => null,
            'status' => 'Aktif',
            'created_at' => now(),
            'updated_at' => now(),
        ]);
---
select exists(select * from `ponpes` where `id_ponpes` = 'ponpes_VAFu4uZ5MEf5PyDn') as `exists`
insert into `ponpes` (`id_ponpes`, `nama_ponpes`, `alamat`, `tahun_berdiri`, `telp`, `email`, `logo_ponpes`, `jumlah_santri`, `jumlah_staf`, `pimpinan`, `status`, `created_at`, `updated_at`) values ('ponpes_VAFu4uZ5MEf5PyDn', 'Random', null, null, null, null, null, 0, 0, null, 'Aktif', '2026-01-31 17:23:20', '2026-01-31 17:23:20')

public function verifyOtp(Request $request)
{
    try {
        // PERBAIKI VALIDASI: Gunakan input dari form
        $request->validate([
            'email' => 'required|email',
            'otp' => 'required|string|size:6',
        ]);

        // ✅ CEK APAKAH INI MASIH DALAM SESI REGISTRASI
        if (!Session::get('registration_pending') || !Session::get('pending_user_id')) {
            // Jika session hilang, hapus data yang mungkin masih ada
            $this->cleanupFailedRegistration();

            return redirect()->route('registrasi.index')->withErrors([
                'error' => 'Sesi registrasi telah berakhir. Silakan registrasi ulang.'
            ]);
        }

        // ✅ DAPATKAN EMAIL DARI SESSION JIKA REQUEST KOSONG
        $email = $request->email ?? session('email');

        if (empty($email)) {
            return back()->withErrors([
                'email' => 'Email tidak ditemukan. Silakan coba lagi.'
            ])->withInput();
        }

        // ✅ CARI USER YANG MASIH PENDING
        $user = User::where('email', $email)
            ->where('otp_code', $request->otp)
            ->where('otp_expired_at', '>', now())
            ->where('status', 'pending')
            ->where('id_user', Session::get('pending_user_id')) // Pastikan user sesuai sesi
            ->first();
---
select * from `user` where `email` = 'sandyujang21@gmail.com' and `otp_code` = '432132' and `otp_expired_at` > '2026-01-31 17:35:27' and `status` = 'pending' and `id_user` = 4175 limit 1

private function cleanupFailedRegistration()
{
    $userId = Session::get('pending_user_id');
    $ponpesId = Session::get('pending_ponpes_id');
    $isNewPonpes = Session::get('is_new_ponpes');

    Log::info('Cleanup started (NO TRANSACTION):', [
        'user_id' => $userId,
        'ponpes_id' => $ponpesId,
        'is_new_ponpes' => $isNewPonpes
    ]);

    try {
        // 1. Hapus user tanpa transaction
        if ($userId) {
            $userDeleted = DB::table('user')
                ->where('id_user', $userId)
                ->where('status', 'pending')
                ->delete();

            Log::info("NO TRANSACTION User deletion: deleted {$userDeleted} row(s) for user ID: {$userId}");
        }

        // 2. Hapus ponpes baru jika tidak ada user lain
        if ($isNewPonpes && $ponpesId) {
            // Cek apakah masih ada user lain di ponpes ini
            $otherUsersCount = DB::table('user')
                ->where('ponpes_id', $ponpesId)
                ->count();
---
delete from `user` where `id_user` = 4175 and `status` = 'pending'
select count(*) as aggregate from `user` where `ponpes_id` = 'ponpes_WQUJ0gV2ozFfKXTM'


            if ($otherUsersCount === 0) {
                // Hapus subscription
                $subscriptionsDeleted = DB::table('subscriptions')
                    ->where('ponpes_id', $ponpesId)
                    ->delete();
---
delete from `subscriptions` where `ponpes_id` = 'ponpes_WQUJ0gV2ozFfKXTM'

                Log::info("NO TRANSACTION Subscriptions deleted: {$subscriptionsDeleted} for ponpes: {$ponpesId}");

                // Hapus ponpes
                $ponpesDeleted = DB::table('ponpes')
                    ->where('id_ponpes', $ponpesId)
                    ->delete();
---
delete from `ponpes` where `id_ponpes` = 'ponpes_WQUJ0gV2ozFfKXTM'

                Log::info("NO TRANSACTION Ponpes deleted: {$ponpesDeleted} for ponpes ID: {$ponpesId}");

                // Verifikasi penghapusan
                $verifyPonpes = DB::table('ponpes')->where('id_ponpes', $ponpesId)->exists();
---
select exists(select * from `ponpes` where `id_ponpes` = 'ponpes_WQUJ0gV2ozFfKXTM') as `exists`