app/Http/Controllers/Super/LanggananController.php

select * from `plans` where `plans`.`id` in (4)
select * from `subscriptions` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `subscriptions`
select count(*) as aggregate from `subscriptions` where `status` = 'active'
select count(*) as aggregate from `subscriptions` where `status` = 'expired'
select count(*) as aggregate from `subscriptions` where `status` = 'trial'
select * from `plans` where `plans`.`id` in (3, 4)
select * from `subscriptions` where `status` = 'active'
select * from `subscriptions` where `status` = 'active' and month(`created_at`) = '04'
---
    public function index(Request $request)
    {
        $status = $request->get('status');
        $search = $request->get('search');
        $planId = $request->get('plan_id');

        $subscriptionsQuery = Subscription::with(['ponpes', 'plan']);

        if ($status) {
            $subscriptionsQuery->where('status', $status);
        }

        if ($planId) {
            $subscriptionsQuery->where('plan_id', $planId);
        }

        if ($search) {
            $subscriptionsQuery->whereHas('ponpes', function ($q) use ($search) {
                $q->where('nama_ponpes', 'like', "%{$search}%");
            });
        }

        $langganan = $subscriptionsQuery->orderBy('created_at', 'desc')->paginate(20); // Ganti nama variabel

        $statistics = [
            'total_langganan' => Subscription::count(),
            'active_langganan' => Subscription::where('status', Subscription::STATUS_ACTIVE)->count(),
            'expired_langganan' => Subscription::where('status', Subscription::STATUS_EXPIRED)->count(),
            'pending_langganan' => Subscription::where('status', Subscription::STATUS_TRIAL)->count(),
            'total_revenue' => Subscription::where('status', Subscription::STATUS_ACTIVE)
                ->with('plan')
                ->get()
                ->sum(function ($sub) {
                    $price = $sub->billing_cycle === 'monthly'
                        ? ($sub->plan->price_month ?? 0)
                        : ($sub->plan->price_year ?? 0);
                    return $price;
                }),
            'revenue_this_month' => Subscription::where('status', Subscription::STATUS_ACTIVE)
                ->whereMonth('created_at', Carbon::now()->month)
                ->with('plan')
                ->get()
                ->sum(function ($sub) {
                    $price = $sub->billing_cycle === 'monthly'
                        ? ($sub->plan->price_month ?? 0)
                        : ($sub->plan->price_year ?? 0);
                    return $price;
                })