app/Http/Controllers/Super/PlanManagementController.php

select * from `plans` order by `price_month` asc limit 10 offset 0
select count(*) as aggregate from `plans`
select count(*) as aggregate from `plans` where `is_active` = 1
select count(*) as aggregate from `plans` where `is_active` = 0
select count(*) as aggregate from `subscriptions` where `status` = 'active'
select `plans`.*, (select count(*) from `subscriptions` where `plans`.`id` = `subscriptions`.`plan_id`) as `subscriptions_count` from `plans` order by `subscriptions_count` desc limit 1
---
    public function index(Request $request)
    {
        $search = $request->get('search');
        $isActive = $request->get('is_active');

        $plansQuery = Plan::query();

        if ($search) {
            $plansQuery->where('name', 'like', "%{$search}%")
                ->orWhere('description', 'like', "%{$search}%");
        }

        if ($isActive !== null) {
            $plansQuery->where('is_active', $isActive);
        }

        $plans = $plansQuery->orderBy('price_month')->paginate(10);

        $statistics = [
            'total_plans' => Plan::count(),
            'active_plans' => Plan::where('is_active', 1)->count(),
            'inactive_plans' => Plan::where('is_active', 0)->count(),
            'total_subscribers' => \App\Models\Subscription::where('status', 'active')->count(),
            'most_popular_plan' => Plan::withCount('subscriptions')
                ->orderBy('subscriptions_count', 'desc')
                ->first()

select * from `plan_features` where `plan_features`.`plan_id` in (4)
select * from `subscriptions` where `subscriptions`.`plan_id` in (4) limit 10
select count(*) as aggregate from `subscriptions` where `subscriptions`.`plan_id` = 4 and `subscriptions`.`plan_id` is not null and `status` = 'active'
select count(*) as aggregate from `subscriptions` where `subscriptions`.`plan_id` = 4 and `subscriptions`.`plan_id` is not null and `billing_cycle` = 'monthly' and `status` = 'active'
select count(*) as aggregate from `subscriptions` where `subscriptions`.`plan_id` = 4 and `subscriptions`.`plan_id` is not null and `billing_cycle` = 'yearly' and `status` = 'active'
---
    public function show($id)
    {
        $plan = Plan::with(['features', 'subscriptions' => function($query) {
            $query->with('ponpes')->limit(10);
        }])->findOrFail($id);

        $statistics = [
            'total_subscribers' => $plan->subscriptions()->count(),
            'active_subscribers' => $plan->subscriptions()->where('status', 'active')->count(),
            'monthly_revenue' => $plan->subscriptions()
                ->where('billing_cycle', 'monthly')
                ->where('status', 'active')
                ->count() * $plan->price_month,
            'yearly_revenue' => $plan->subscriptions()
                ->where('billing_cycle', 'yearly')
                ->where('status', 'active')
                ->count() * $plan->price_year,

select * from `plan_features` where `plan_features`.`plan_id` in (4)
select * from `plans` where `plans`.`id` = '4' limit 1
---
    public function edit($id)
    {
        $plan = Plan::with('features')->findOrFail($id);

select * from `plans` where `plans`.`id` = '1' limit 1
---
    public function update(Request $request, $id)
    {
        $plan = Plan::findOrFail($id);

delete from `plan_features` where `plan_id` = 1
---
            // Update features
            if (isset($validated['features'])) {
                // Delete old features
                PlanFeature::where('plan_id', $plan->id)->delete();

insert into `plan_features` (`plan_id`, `feature_key`, `enabled`) values (1, 'santri', 1)
---
                // Save new features
                foreach ($validated['features'] as $feature) {
                    if (!empty($feature['key']) && isset($feature['value'])) {
                        PlanFeature::create([
                            'plan_id' => $plan->id,
                            'feature_key' => $feature['key'],
                            'enabled' => $feature['value'] === 'true' || $feature['value'] === true
                        ]);

select * from `plans` where `plans`.`id` = '5' limit 1
select count(*) as aggregate from `subscriptions` where `subscriptions`.`plan_id` = 5 and `subscriptions`.`plan_id` is not null and `status` = 'active'
delete from `plans` where `id` = 5
---
    public function destroy($id)
    {
        $plan = Plan::findOrFail($id);

        // Check if plan has active subscriptions
        $activeSubscriptions = $plan->subscriptions()->where('status', 'active')->count();

        if ($activeSubscriptions > 0) {
            return redirect()->route('super.plan.index')
                ->with('error', 'Tidak dapat menghapus paket karena masih ada langganan aktif.');
        }

        $planName = $plan->name;
        $plan->delete();