app/Http/Controllers/Dashboardcontroller.php

    public function getAllAbsensi(): JsonResponse
    {
        $user = Auth::user();

        $data = DB::table('absensi as a')
            ->select('a.id_absensi', 'a.jam', 'a.tanggal', 'a.status', 'a.keterangan')
            ->where('a.user_id', $user->id_user)
            ->where('a.ponpes_id', $user->ponpes_id)
            ->whereIn('a.id_absensi', function ($query) use ($user) {
                $query->selectRaw('MAX(id_absensi)')
                    ->from('absensi')
                    ->where('user_id', $user->id_user)
                    ->where('ponpes_id', $user->ponpes_id)
                    ->groupBy('tanggal');
            })
            ->orderByDesc('a.tanggal')
            ->limit(6)
            ->get();
---
select `a`.`id_absensi`, `a`.`jam`, `a`.`tanggal`, `a`.`status`, `a`.`keterangan` from `absensi` as `a` where `a`.`user_id` = 4123 and `a`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `a`.`id_absensi` in (select MAX(id_absensi) from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `tanggal`) order by `a`.`tanggal` desc limit 6

    public function index()
    {
        $user = Auth::user();

        // Hitung total absensi
        $counts = DB::table('absensi')
            ->select('status', DB::raw('COUNT(*) as total'))
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->groupBy('status')
            ->pluck('total', 'status');

        $jumlahHadir = $counts['Hadir'] ?? 0;
        $jumlahIzin = $counts['Izin'] ?? 0;
        $jumlahSakit = $counts['Sakit'] ?? 0;
        $jumlahAlpa = $counts['Alpa'] ?? 0;

        // Ambil kelas
        $kelas = DB::table('kelas')
            ->select('id_kelas', 'nama_kelas')
            ->where('ponpes_id', $user->ponpes_id)
            ->orderBy('tingkat')
            ->orderBy('nama_kelas')
            ->get();

        // Akademik terbaik
        $akademikTerbaik = DB::table('pencapaian as p')
            ->join('santri as s', 'p.id_santri', '=', 's.id_santri')
            ->select('s.id_santri', 's.nama', 's.nisn', DB::raw('COUNT(*) as total'))
            ->where('p.tipe', 'Akademik')
            ->where('p.ponpes_id', $user->ponpes_id)
            ->where('s.ponpes_id', $user->ponpes_id)
            ->groupBy('s.id_santri', 's.nama', 's.nisn')
            ->orderByDesc('total')
            ->limit(4)
            ->get();

        // Tahfidz terbaik
        $tahfidzTerbaik = DB::table('pencapaian as p')
            ->join('santri as s', 'p.id_santri', '=', 's.id_santri')
            ->select('s.id_santri', 's.nama', 's.nisn', DB::raw('COUNT(*) as total'))
            ->where('p.tipe', 'Tahfidz')
            ->where('p.ponpes_id', $user->ponpes_id)
            ->where('s.ponpes_id', $user->ponpes_id)
            ->groupBy('s.id_santri', 's.nama', 's.nisn')
            ->orderByDesc('total')
            ->limit(4)
            ->get();
---
select `status`, COUNT(*) as total from `absensi` where `user_id` = 4166 and `ponpes_id` = 'ponpes_mJMS0QktJpT0fBqi' group by `status`
select `id_kelas`, `nama_kelas` from `kelas` where `ponpes_id` = 'ponpes_mJMS0QktJpT0fBqi' order by `tingkat` asc, `nama_kelas` asc
select `s`.`id_santri`, `s`.`nama`, `s`.`nisn`, COUNT(*) as total from `pencapaian` as `p` inner join `santri` as `s` on `p`.`id_santri` = `s`.`id_santri` where `p`.`tipe` = 'Akademik' and `p`.`ponpes_id` = 'ponpes_mJMS0QktJpT0fBqi' and `s`.`ponpes_id` = 'ponpes_mJMS0QktJpT0fBqi' group by `s`.`id_santri`, `s`.`nama`, `s`.`nisn` order by `total` desc limit 4
select `s`.`id_santri`, `s`.`nama`, `s`.`nisn`, COUNT(*) as total from `pencapaian` as `p` inner join `santri` as `s` on `p`.`id_santri` = `s`.`id_santri` where `p`.`tipe` = 'Tahfidz' and `p`.`ponpes_id` = 'ponpes_mJMS0QktJpT0fBqi' and `s`.`ponpes_id` = 'ponpes_mJMS0QktJpT0fBqi' group by `s`.`id_santri`, `s`.`nama`, `s`.`nisn` order by `total` desc limit 4

    public function getGrafikPrestasi(Request $request): JsonResponse
    {
        $userPonpesId = Auth::user()->ponpes_id;

        $query = DB::table('pencapaian')
            ->join('santri', 'pencapaian.id_santri', '=', 'santri.id_santri')
            ->join('kelas', 'santri.id_kelas', '=', 'kelas.id_kelas')
            ->select('pencapaian.tipe', DB::raw('COUNT(*) as total'))
            ->where('pencapaian.ponpes_id', $userPonpesId)
            ->where('santri.ponpes_id', $userPonpesId)
            ->where('kelas.ponpes_id', $userPonpesId)
            ->groupBy('pencapaian.tipe');

        if ($request->filled('kelas') && $request->kelas !== 'Semua') {
            $query->where('kelas.nama_kelas', $request->kelas);
---
select `pencapaian`.`tipe`, COUNT(*) as total from `pencapaian` inner join `santri` on `pencapaian`.`id_santri` = `santri`.`id_santri` inner join `kelas` on `santri`.`id_kelas` = `kelas`.`id_kelas` where `pencapaian`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `santri`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `kelas`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `kelas`.`nama_kelas` = '5 Mawar' group by `pencapaian`.`tipe`

    public function checkTodayAbsensi(): JsonResponse
    {
        $user = Auth::user();
        $tanggalHariIni = Carbon::now()->toDateString();

        $absensiHariIni = DB::table('absensi')
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->where('tanggal', $tanggalHariIni)
            ->first();
---
select * from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `tanggal` = '2026-01-31' limit 1

    public function riwayat(Request $request)
    {
        $currentUser = Auth::user();
        $selectedUserId = $request->query('user_id');

        /**
         * ========================
         * CASE ADMIN
         * ========================
         */
        if ($currentUser->role === 'Admin') {

            // ADMIN hanya melihat Pengajar & Keuangan dari ponpes sendiri
            $users = DB::table('user as u')
                ->join('ponpes as p', 'u.ponpes_id', '=', 'p.id_ponpes')
                ->select('u.id_user', 'u.username', 'u.role', 'p.nama_ponpes', 'u.email')
                ->where('u.ponpes_id', $currentUser->ponpes_id)   // << PROTEKSI PONPES
                ->whereIn('u.role', ['Pengajar', 'Keuangan'])     // << BATAS ROLE
                ->get();
---
select `u`.`id_user`, `u`.`username`, `u`.`role`, `p`.`nama_ponpes`, `u`.`email` from `user` as `u` inner join `ponpes` as `p` on `u`.`ponpes_id` = `p`.`id_ponpes` where `u`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `u`.`role` in ('Pengajar', 'Keuangan')