app/Http/Controllers/Dashboardcontroller.php

select exists(select * from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and date(`tanggal`) = '2026-02-01') as `exists`
insert into `absensi` (`ponpes_id`, `user_id`, `tanggal`, `jam`, `status`, `keterangan`, `created_at`, `updated_at`) values ('ponpes_D4JbYcVwXgy9rqgt', 4123, '2026-02-01', '17:00:00', 'Alpa', 'Auto: Tidak absen sampai batas waktu', '2026-02-01 23:05:01', '2026-02-01 23:05:01')
---
    private function processAutoAlfa()
    {
        $user = Auth::user();
        if (!$user) {
            return;
        }

        $today = Carbon::today('Asia/Jakarta')->toDateString();
        $now = Carbon::now('Asia/Jakarta');

        // Waktu batas akhir untuk absen (17:00 WIB)
        $cutoffTime = Carbon::createFromTime(17, 0, 0, 'Asia/Jakarta');

        // Cek apakah sudah lewat jam 17:00
        if ($now->greaterThan($cutoffTime)) {
            // Cek apakah user sudah absen hari ini
            $hasAbsenToday = DB::table('absensi')
                ->where('user_id', $user->id_user)
                ->where('ponpes_id', $user->ponpes_id)
                ->whereDate('tanggal', $today)
                ->exists();

            // Jika belum absen dan sudah lewat jam 17:00, tandai sebagai alfa
            if (!$hasAbsenToday) {
                DB::table('absensi')->insert([
                    'ponpes_id'   => $user->ponpes_id,
                    'user_id'     => $user->id_user,
                    'tanggal'     => $today,
                    'jam'         => '17:00:00',
                    'status'      => 'Alpa',
                    'keterangan'  => 'Auto: Tidak absen sampai batas waktu',
                    'created_at'  => now(),
                    'updated_at'  => now(),
                ]);

select `tanggal`, `status` from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt'
---
    public static function scheduleAutoAlfa()
    {
        $today = Carbon::today('Asia/Jakarta')->toDateString();

        // Ambil semua user aktif
        $activeUsers = DB::table('user')
            ->where('status', 'active')
            ->whereNotNull('ponpes_id')
            ->get(['id_user', 'ponpes_id', 'username']);

        $markedCount = 0;

        foreach ($activeUsers as $user) {
            // Cek apakah user sudah absen hari ini
            $hasAbsen = DB::table('absensi')
                ->where('user_id', $user->id_user)
                ->where('ponpes_id', $user->ponpes_id)
                ->whereDate('tanggal', $today)
                ->exists();

select `id_absensi`, `jam`, `tanggal`, `status`, `keterangan` from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `id_absensi` in (select MAX(id_absensi) from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `tanggal`) order by `tanggal` desc limit 6
select `status`, COUNT(*) as total from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `status`
---
    public function getAllAbsensi(): JsonResponse
    {
        $user = Auth::user();

        $data = DB::table('absensi')
            ->select('id_absensi', 'jam', 'tanggal', 'status', 'keterangan')
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->whereIn('id_absensi', function ($query) use ($user) {
                $query->selectRaw('MAX(id_absensi)')
                    ->from('absensi')
                    ->where('user_id', $user->id_user)
                    ->where('ponpes_id', $user->ponpes_id)
                    ->groupBy('tanggal');
            })
            ->orderByDesc('tanggal')
            ->limit(6)
            ->get();

        // Format tanggal dan jam
        $formattedData = $data->map(function ($item) {
            return [
                'id_absensi' => $item->id_absensi,
                'tanggal' => Carbon::parse($item->tanggal)->translatedFormat('d F Y'),
                'hari' => Carbon::parse($item->tanggal)->translatedFormat('l'),
                'jam' => $item->jam ? Carbon::parse($item->jam)->format('H:i') : '-',
                'status' => $item->status,
                'keterangan' => $item->keterangan ?? '-',
                'status_color' => $this->getStatusColor($item->status)
            ];
        });

select `tanggal`, `status` from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt'
---
    public function getAbsensi(): JsonResponse
    {
        $user = Auth::user();

        $absensi = DB::table('absensi')
            ->select('tanggal', 'status')
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->get()
            ->groupBy('tanggal')
            ->map(function ($items) {
                return [
                    'status' => $items->first()->status,
                    'color' => $this->getStatusColor($items->first()->status)
                ];
            });

select `status`, COUNT(*) as total from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `status`
select `id_kelas`, `nama_kelas` from `kelas` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' order by `tingkat` asc, `nama_kelas` asc
select `pencapaian`.`tipe`, COUNT(*) as total from `pencapaian` inner join `santri` on `pencapaian`.`id_santri` = `santri`.`id_santri` inner join `kelas` on `santri`.`id_kelas` = `kelas`.`id_kelas` where `pencapaian`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `santri`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `kelas`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `kelas`.`nama_kelas` = '5 Mawar' group by `pencapaian`.`tipe`
select `s`.`id_santri`, `s`.`nama`, `s`.`nisn`, COUNT(*) as total from `pencapaian` as `p` inner join `santri` as `s` on `p`.`id_santri` = `s`.`id_santri` where `p`.`tipe` = 'Tahfidz' and `p`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `s`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `s`.`id_santri`, `s`.`nama`, `s`.`nisn` order by `total` desc limit 4
select * from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and date(`tanggal`) = '2026-03-25' limit 1
---
    public function index()
    {
        $user = Auth::user();

        // Hitung total absensi
        $counts = DB::table('absensi')
            ->select('status', DB::raw('COUNT(*) as total'))
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->groupBy('status')
            ->pluck('total', 'status');

        $jumlahHadir = $counts['Hadir'] ?? 0;
        $jumlahIzin = $counts['Izin'] ?? 0;
        $jumlahSakit = $counts['Sakit'] ?? 0;
        $jumlahAlpa = $counts['Alpa'] ?? 0;

        // Ambil kelas
        $kelas = DB::table('kelas')
            ->select('id_kelas', 'nama_kelas')
            ->where('ponpes_id', $user->ponpes_id)
            ->orderBy('tingkat')
            ->orderBy('nama_kelas')
            ->get();

        // Akademik terbaik
        $akademikTerbaik = DB::table('pencapaian as p')
            ->join('santri as s', 'p.id_santri', '=', 's.id_santri')
            ->select('s.id_santri', 's.nama', 's.nisn', DB::raw('COUNT(*) as total'))
            ->where('p.tipe', 'Akademik')
            ->where('p.ponpes_id', $user->ponpes_id)
            ->where('s.ponpes_id', $user->ponpes_id)
            ->groupBy('s.id_santri', 's.nama', 's.nisn')
            ->orderByDesc('total')
            ->limit(4)
            ->get();

        // Tahfidz terbaik
        $tahfidzTerbaik = DB::table('pencapaian as p')
            ->join('santri as s', 'p.id_santri', '=', 's.id_santri')
            ->select('s.id_santri', 's.nama', 's.nisn', DB::raw('COUNT(*) as total'))
            ->where('p.tipe', 'Tahfidz')
            ->where('p.ponpes_id', $user->ponpes_id)
            ->where('s.ponpes_id', $user->ponpes_id)
            ->groupBy('s.id_santri', 's.nama', 's.nisn')
            ->orderByDesc('total')
            ->limit(4)
            ->get();

        // Cek absensi hari ini
        $todayAbsensi = DB::table('absensi')
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->whereDate('tanggal', Carbon::today())
            ->first();

select count(*) as aggregate from `absensi` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `user_id` = 4123
select `status`, COUNT(*) as total from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and month(`tanggal`) = '03' and year(`tanggal`) = 2026 group by `status`
---
        $bulanIni = Carbon::now()->month;
        $tahunIni = Carbon::now()->year;

        $absensiBulanIni = DB::table('absensi')
            ->select('status', DB::raw('COUNT(*) as total'))
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->whereMonth('tanggal', $bulanIni)
            ->whereYear('tanggal', $tahunIni)
            ->groupBy('status')
            ->pluck('total', 'status');

select `pencapaian`.`tipe`, COUNT(*) as total from `pencapaian` inner join `santri` on `pencapaian`.`id_santri` = `santri`.`id_santri` inner join `kelas` on `santri`.`id_kelas` = `kelas`.`id_kelas` where `pencapaian`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `santri`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `kelas`.`ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `kelas`.`nama_kelas` = '5 Mawar' group by `pencapaian`.`tipe`
---
    public function getGrafikPrestasi(Request $request): JsonResponse
    {
        $userPonpesId = Auth::user()->ponpes_id;

        $query = DB::table('pencapaian')
            ->join('santri', 'pencapaian.id_santri', '=', 'santri.id_santri')
            ->join('kelas', 'santri.id_kelas', '=', 'kelas.id_kelas')
            ->select('pencapaian.tipe', DB::raw('COUNT(*) as total'))
            ->where('pencapaian.ponpes_id', $userPonpesId)
            ->where('santri.ponpes_id', $userPonpesId)
            ->where('kelas.ponpes_id', $userPonpesId)
            ->groupBy('pencapaian.tipe');

        if ($request->filled('kelas') && $request->kelas !== 'Semua') {
            $query->where('kelas.nama_kelas', $request->kelas);
        }

        $data = $query->pluck('total', 'tipe');

select * from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `tanggal` = '2026-03-25' limit 1
---
    public function checkTodayAbsensi(): JsonResponse
    {
        $user = Auth::user();
        $tanggalHariIni = Carbon::now()->toDateString();

        $absensiHariIni = DB::table('absensi')
            ->where('user_id', $user->id_user)
            ->where('ponpes_id', $user->ponpes_id)
            ->where('tanggal', $tanggalHariIni)
            ->first();

select `status`, COUNT(*) as total from `absensi` where `user_id` = 4123 and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `status`
select count(*) as aggregate from `absensi` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `user_id` = 4123 and `status` = 'Hadir' and month(`tanggal`) = '02' and year(`tanggal`) = 2026
---
    public function riwayat(Request $request)
    {
        $user = Auth::user();
        $userPonpesId = $user->ponpes_id;
        $userId = $user->id_user;

        // Hitung statistik
        $stats = DB::table('absensi')
            ->select('status', DB::raw('COUNT(*) as total'))
            ->where('ponpes_id', $userPonpesId)
            ->where('user_id', $userId)
            ->groupBy('status')
            ->pluck('total', 'status');

        $totalAbsensi = array_sum($stats->toArray());
        $hadir = $stats['Hadir'] ?? 0;
        $izin = $stats['Izin'] ?? 0;
        $sakit = $stats['Sakit'] ?? 0;
        $alpa = $stats['Alpa'] ?? 0;

        // Hitung persentase kehadiran bulan ini
        $bulanIni = Carbon::now()->month;
        $tahunIni = Carbon::now()->year;

        $hariKerjaBulanIni = $this->hitungHariKerja($bulanIni, $tahunIni);
        $hadirBulanIni = DB::table('absensi')
            ->where('ponpes_id', $userPonpesId)
            ->where('user_id', $userId)
            ->where('status', 'Hadir')
            ->whereMonth('tanggal', $bulanIni)
            ->whereYear('tanggal', $tahunIni)
            ->count();