app/Http/Controllers/InventarisController.php

select count(*) as aggregate from `inventaris` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt'
select `kategori`, SUM(jumlah) as total_jumlah from `inventaris` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' group by `kategori`
---
            }

            // Data untuk chart (ringkasan per kategori) - hanya data ponpes user
            $chartData = Inventaris::where('ponpes_id', $userPonpesId)
                ->select('kategori', DB::raw('SUM(jumlah) as total_jumlah'))
                ->groupBy('kategori')
                ->get();

select distinct `kategori` from `inventaris` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt'
---
            $inventaris = $query->orderBy('created_at', 'desc')->paginate(10);

            // Data untuk filter dropdown - hanya data ponpes user
            $kategories = Inventaris::where('ponpes_id', $userPonpesId)
                ->distinct()
                ->pluck('kategori')
                ->filter();