app/Http/Controllers/KategoriController.php

select `id_kategori`, `nama_kategori` from `kategori` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' order by `nama_kategori` asc limit 10 offset 0
select count(*) as aggregate from `kategori` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt'
---
    public function index()
    {
        try {
            $userPonpesId = $this->getUserPonpesId();

            $kategories = Kategori::where('ponpes_id', $userPonpesId)
                ->select('id_kategori', 'nama_kategori')
                ->orderBy('nama_kategori', 'asc')
                ->paginate(10);