app/Http/Controllers/KepegawaianController.php

select count(*) as aggregate from `user` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `status` = 'aktif'
---
        // Ambil data ponpes untuk header
        $ponpes = Ponpes::where('id_ponpes', Auth::user()->ponpes_id)->first();

        return view('pages.kepegawaian', [
            // Hitungan berdasarkan status enum
            'aktif' => (clone $statsQuery)->where('status', 'active')->count(),
            'Tidakaktif' => (clone $statsQuery)->whereIn('status', ['pending', 'suspended'])->count(),
            // role counts
            'countPengajar' => (clone $statsQuery)->whereRaw("LOWER(role) = ?", ['pengajar'])->count(),
            'countAdmin' => (clone $statsQuery)->whereRaw("LOWER(role) = ?", ['admin'])->count(),
            'countKeuangan' => (clone $statsQuery)->whereRaw("LOWER(role) = ?", ['keuangan'])->count(),
            'total' => $statsQuery->count(),
            'users' => $users,
            'q' => $q,
            'filteredCount' => $q !== '' ? $users->count() : null,
            'ponpes' => $ponpes,
        ]);