app/Http/Controllers/KeuanganController.php

public function index(Request $request)
{
    try {
        $userPonpesId = $this->getUserPonpesId();
        $filter = $request->get('filter', '1-tahun');

        // ==================== LAZY LOADING IMPLEMENTATION ====================

        // 1. DATA UNTUK TABEL (PAGINATION - Tetap efficient)
        $tableQuery = Keuangan::with(['kategori:id_kategori,nama_kategori', 'user:id_user,username'])
            ->where('ponpes_id', $userPonpesId)
            ->select('id_keuangan', 'jumlah', 'sumber_dana', 'status',
                     'tanggal', 'keterangan', 'id_kategori', 'user_id', 'ponpes_id');

        $tableData = $tableQuery->orderBy('tanggal', 'desc')->paginate(10);
---
select `id_keuangan`, `jumlah`, `sumber_dana`, `status`, `tanggal`, `keterangan`, `id_kategori`, `user_id`, `ponpes_id` from `keuangan` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' order by `tanggal` desc limit 10 offset 0
select `id_kategori`, `nama_kategori` from `kategori` where `kategori`.`id_kategori` in (19, 21, 22, 23, 25, 30)
select `id_user`, `username` from `user` where `user`.`id_user` in (4123)
select count(*) as aggregate from `keuangan` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt'