app/Http/Controllers/NotulenController.php

select * from `user` where `user`.`id_user` in (4123)
---
    public function index(Request $request)
    {
        try {
            Log::info('Mengakses halaman notulen index', [
                'user_id' => $this->getAuthUserId(),
                'ponpes_id' => $this->getUserPonpesId()
            ]);

            $userPonpesId = $this->getUserPonpesId();

            // Query dasar dengan proteksi ponpes_id
            $query = Notulen::with(['user', 'gambar'])
                ->where('ponpes_id', $userPonpesId);

            // Apply search filter
            if ($request->has('search') && $request->search != '') {
                $search = $request->search;
                $query->where(function ($q) use ($search) {
                    $q->where('agenda', 'like', "%{$search}%")
                        ->orWhere('peserta', 'like', "%{$search}%")
                        ->orWhere('tempat', 'like', "%{$search}%")
                        ->orWhere('hasil', 'like', "%{$search}%")
                        ->orWhere('pimpinan', 'like', "%{$search}%");
                });
            }

            // Apply tanggal filter
            if ($request->has('tanggal') && $request->tanggal != '') {
                $query->where('tanggal', $request->tanggal);

select * from `gambar` where exists (select * from `notulensi_rapat` where `gambar`.`id_notulen` = `notulensi_rapat`.`id_notulen` and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt') and `id_notulen` is not null order by `created_at` desc limit 6
select count(*) as aggregate from `gambar` where exists (select * from `notulensi_rapat` where `gambar`.`id_notulen` = `notulensi_rapat`.`id_notulen` and `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt') and `id_notulen` is not null
---
                ->sortDesc();

            // Recent gambar dengan proteksi ponpes_id
            $recentGambar = Gambar::with(['notulen' => function($query) use ($userPonpesId) {
                    $query->where('ponpes_id', $userPonpesId);
                }])
                ->whereHas('notulen', function($query) use ($userPonpesId) {
                    $query->where('ponpes_id', $userPonpesId);
                })
                ->whereNotNull('id_notulen')
                ->orderBy('created_at', 'desc')
                ->take(6)
                ->get();

            // Data untuk statistik (hanya data ponpes user)
            $totalGambar = Gambar::whereHas('notulen', function($query) use ($userPonpesId) {
                    $query->where('ponpes_id', $userPonpesId);
                })
                ->whereNotNull('id_notulen')
                ->count();

select * from `user` where `user`.`id_user` in (4123)
---
                ->first();

            // Recent activities dengan proteksi ponpes_id
            $recentActivities = Notulen::with('user')
                ->where('ponpes_id', $userPonpesId)
                ->orderBy('created_at', 'desc')
                ->take(4)
                ->get();