app/Http/Controllers/RiwayatController.php

        public function index(Request $request)
        {
            // Get authenticated user
            $user = Auth::user();

            // Get filter parameters
            $month = $request->get('month');
            $year = $request->get('year');
            $status = $request->get('status');

            // Base query for absensi - menggunakan kolom yang benar (asumsi user_id)
            $absensiQuery = Absensi::where('user_id', $user->id);

            // Apply filters
            if ($month) {
                $absensiQuery->whereMonth('tanggal', $month);
            }

            if ($year) {
                $absensiQuery->whereYear('tanggal', $year);
            }

            if ($status) {
                $absensiQuery->where('status', $status);
            }

            // Order by date descending
            $absensiQuery->orderBy('tanggal', 'desc');

            // Get paginated results
            $absensi = $absensiQuery->paginate(10);
---
select count(*) as aggregate from `absensi` where `user_id` is null

            });

            // Calculate statistics - menggunakan kolom yang benar
            $totalAbsensi = Absensi::where('user_id', $user->id)->count();

            // Count by status (all time)
            $hadir = Absensi::where('user_id', $user->id)
                ->where('status', 'Hadir')
                ->count();

            $izin = Absensi::where('user_id', $user->id)
                ->where('status', 'Izin')
                ->count();

            $sakit = Absensi::where('user_id', $user->id)
                ->where('status', 'Sakit')
                ->count();

            $alpa = Absensi::where('user_id', $user->id)
                ->where('status', 'Alpa')
                ->count();
---
select count(*) as aggregate from `absensi` where `user_id` is null
select count(*) as aggregate from `absensi` where `user_id` is null and `status` = 'Hadir'
select count(*) as aggregate from `absensi` where `user_id` is null and `status` = 'Izin'
select count(*) as aggregate from `absensi` where `user_id` is null and `status` = 'Sakit'
select count(*) as aggregate from `absensi` where `user_id` is null and `status` = 'Alpa'

            $currentMonth = Carbon::now()->month;
            $currentYear = Carbon::now()->year;

            $hadirBulanIni = Absensi::where('user_id', $user->id)
                ->whereMonth('tanggal', $currentMonth)
                ->whereYear('tanggal', $currentYear)
                ->where('status', 'Hadir')
                ->count();

            $izinBulanIni = Absensi::where('user_id', $user->id)
                ->whereMonth('tanggal', $currentMonth)
                ->whereYear('tanggal', $currentYear)
                ->where('status', 'Izin')
                ->count();

            $sakitBulanIni = Absensi::where('user_id', $user->id)
                ->whereMonth('tanggal', $currentMonth)
                ->whereYear('tanggal', $currentYear)
                ->where('status', 'Sakit')
                ->count();

            $alpaBulanIni = Absensi::where('user_id', $user->id)
                ->whereMonth('tanggal', $currentMonth)
                ->whereYear('tanggal', $currentYear)
                ->where('status', 'Alpa')
                ->count();
---
select count(*) as aggregate from `absensi` where `user_id` is null and month(`tanggal`) = '03' and year(`tanggal`) = 2026 and `status` = 'Hadir'
select count(*) as aggregate from `absensi` where `user_id` is null and month(`tanggal`) = '03' and year(`tanggal`) = 2026 and `status` = 'Izin'
select count(*) as aggregate from `absensi` where `user_id` is null and month(`tanggal`) = '03' and year(`tanggal`) = 2026 and `status` = 'Sakit'
select count(*) as aggregate from `absensi` where `user_id` is null and month(`tanggal`) = '03' and year(`tanggal`) = 2026 and `status` = 'Alpa'

                : 0;

            // Get system logs for this user - PERBAIKAN: ganti nama tabel
            $systemLogs = SystemLog::where('user_id', $user->id)
                ->orderBy('created_at', 'desc')
                ->limit(10)
                ->get();
---
select * from `absensi_system_logs` where `user_id` is null order by `created_at` desc limit 10