app/Http/Controllers/SanksiController.php

    public function index(Request $request)
    {
        try {
            Log::info('Mengakses halaman sanksi index', [
                'user_id' => Auth::id(),
                'ponpes_id' => $this->getUserPonpesId()
            ]);

            $userPonpesId = $this->getUserPonpesId();

            $query = Sanksi::with(['user'])
                ->where('ponpes_id', $userPonpesId);

            // Filter by status
            if ($request->has('status') && $request->status != '') {
                $query->where('status', $request->status);
            }

            // Filter by jenis
            if ($request->has('jenis') && $request->jenis != '') {
                $query->where('jenis', $request->jenis);
            }

            // Filter by date range
            if ($request->has('start_date') && $request->start_date != '') {
                $query->where('tanggal', '>=', $request->start_date);
            }

            if ($request->has('end_date') && $request->end_date != '') {
                $query->where('tanggal', '<=', $request->end_date);
---
select * from `user` where `user`.`id_user` in (4123)

            }

            // 🔥 PERBAIKAN: Hapus orderBy created_at karena tidak ada di tabel
            $sanksi = $query->orderBy('tanggal', 'desc')
                ->orderBy('id_sanksi', 'desc') // Gunakan ID sebagai fallback
                ->paginate(10);
---
select * from `sanksi` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' order by `tanggal` desc, `id_sanksi` desc limit 10 offset 0

            // Statistics for dashboard
            $statistics = [
                'total' => Sanksi::where('ponpes_id', $userPonpesId)->count(),
                'aktif' => Sanksi::where('ponpes_id', $userPonpesId)->where('status', 'Aktif')->count(),
                'selesai' => Sanksi::where('ponpes_id', $userPonpesId)->where('status', 'Selesai')->count(),
---
select count(*) as aggregate from `sanksi` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `status` = 'Aktif'
select count(*) as aggregate from `sanksi` where `ponpes_id` = 'ponpes_D4JbYcVwXgy9rqgt' and `status` = 'Selesai'