app/Http/Controllers/UserController.php

select count(*) as aggregate from `user` where `status` = 'Aktif'
select count(*) as aggregate from `user` where `status` = 'Nonaktif'
select count(*) as aggregate from `user`
select `role`, COUNT(*) as count from `user` group by `role`
select count(*) as aggregate from `ponpes`
select * from `ponpes`
---
    public function index(Request $request)
    {
        // Get statistics
        $statistics = [
            'total_users' => User::count(),
            'active_users' => User::where('status', 'Aktif')->count(),
            'inactive_users' => User::where('status', 'Nonaktif')->count(),
            'by_role' => User::groupBy('role')->select('role', \DB::raw('COUNT(*) as count'))->pluck('count', 'role')->toArray(),
            'total_ponpes' => Ponpes::count()
        ];

        // Get ponpes list for filter dropdown
        $ponpesList = Ponpes::all();