app/Http/Controllers/Admin/PonpesController.php

select * from `ponpes` order by `nama_ponpes` asc limit 20 offset 0
select count(*) as aggregate from `ponpes`
---
    public function index()
    {
        $ponpesList = Ponpes::orderBy('nama_ponpes')->paginate(20);